[
    {
        "id": 1,
        "title": "Spring Rolls",
        "image": "Spring Rolls.png",
        "category": "Snacks",
        "shortDescription": "Spring rolls are a popular Chinese snack of crispy rolls filled with a savory mixed vegetables stuffing.",
        "ingredients": ["Flour", "Cabbage", "Carrots", "Capsicum", "Soya sauce", "Onions", "Pepper", "Salt"],
        "cookingTime": "35 mins",
        "instructions": ["1) Prepare the filling: Sauté chopped vegetables like cabbage, carrots, bell peppers, and onions in a pan with some oil, ginger, garlic, and soy sauce.", 
                            "Cook until tender and let it cool.",
                         "2) Assemble the rolls: Place a spring roll wrapper on a flat surface. Add a spoonful of the vegetable filling in the center and fold in the sides.", 
                            "Roll tightly and seal the edge with a bit of water.",
                         "3) Fry the rolls: Heat oil in a pan or deep fryer. Fry the spring rolls until golden and crispy, about 3-4 minutes. Drain on paper towels.",
                         "4) Serve: Enjoy your crispy veg spring rolls with a dipping sauce like sweet chili or soy sauce."]
    },
    {
        "id": 2,
        "title": "Masala Dosa",
        "image": "Dosa.png",
        "category": "BreakFast",
        "shortDescription": "A crispy, golden South Indian pancake stuffed with spicy potato filling.",
        "ingredients": ["Rice", "Urad Dal", "Potatoes", "Curry Leaves", "Spices"],
        "cookingTime": "40 mins", 
        "instructions": ["1) Prepare dosa batter and let it ferment overnight.",
                         "2) Cook a spiced potato filling with mashed potatoes, onions, mustard seeds, curry leaves, and spices.",
                         "3) Heat a griddle, pour batter to form a thin circle, and cook until crispy.",
                         "4) Place the potato filling in the center of the dosa and fold it.",
                         "5) Serve hot with chutney and sambar."]
    },
    {
        "id": 3,
        "title": "Gulab Jamun",
        "image": "Gulab_jamun.png",
        "category": "Dessert",
        "shortDescription": "Soft milk-based dumplings soaked in cardamom-flavored sugar syrup.",
        "ingredients": ["Milk Powder", "Flour", "Baking Soda", "Ghee", "Oil", "Sugar", "Cardamom", "Rose Water"],
        "cookingTime": "40 mins",
        "instructions": ["1) Mix milk powder, flour, baking soda, and ghee to form a smooth dough.",
                         "2) Shape the dough into small balls, ensuring no cracks.",
                         "3) Heat oil in a pan and fry the balls until golden brown.",
                         "4) Soak the fried balls in warm sugar syrup flavored with cardamom and rose water.",
                         "5) Serve hot or at room temperature."]
    },
    {
        "id": 4,
        "title": "Chicken Biryani",
        "image": "Biryani.png",
        "category": "Lunch",
        "shortDescription": "Aromatic rice layered with tender spiced chicken for a royal treat.",
        "ingredients": ["Rice", "Chicken", "Spices", "Yogurt", "Onions", "Herbs", "Garlic", "Ginger", "Tomatoes", "Coriander"],
        "cookingTime": "60 mins",
        "instructions": ["1) Marinate chicken with yogurt, spices, and herbs for at least 30 minutes.",
                         "2) Cook rice with whole spices until 70% done.",
                         "3) Sauté onions, ginger, garlic, and tomatoes, then add marinated chicken and cook until tender.",
                         "4) Layer cooked rice over the chicken and cook on low heat (dum) for 20-25 minutes.",
                         "5) Garnish with fried onions, coriander, and serve hot with raita."]
    },
    {
        "id": 5,
        "title": "Lassi",
        "image": "Lassi.png",
        "category": "Beverages",
        "shortDescription": "Lassi is a yogurt–based beverage with a smoothie-like consistency. It has been called 'the most popular and traditional yogurt-based drink' in India.",
        "ingredients": ["Yogurt", "Sugar", "Milk", "Water", "Rose Water", "Cardamom", "Ice Cubes"],
        "cookingTime": "15 mins",
        "instructions": ["1) Blend yogurt, water (or milk), sugar, and a pinch of cardamom.",
                         "2) Add ice cubes and blend until smooth and frothy.",
                         "3) Serve chilled, garnished with a pinch of cardamom or saffron if desired."]
    },
    {
        "id": 6,
        "title": "Paneer Butter Masala",
        "image": "Paneer_butter_masala.png",
        "category": "lunch",
        "shortDescription": "A creamy and flavorful North Indian curry made with paneer and rich spices.",
        "ingredients": ["Paneer", "Butter", "Tomatoes", "Cream", "Spices", "Turmeric", "Cream", "Garlic", "Ginger"],
        "cookingTime": "30 mins",
        "instructions": ["1) Sauté onions, ginger, garlic, and tomatoes in butter until soft.",
                         "2) Add ground spices (like garam masala, turmeric, and chili powder) and cook for a few minutes.",
                         "3) Add pureed tomatoes and cook until the oil separates from the masala.",
                         "4) Add cubed paneer, cream, and simmer for 5-10 minutes.",
                         "5) Garnish with coriander and serve hot with naan or rice"]
    },
    {
        "id": 7,
        "title": "Black Forest Cake",
        "image": "Black_forest_cake.png",
        "category": "Dessert",
        "shortDescription": "The Black Forest Cake, with its rich chocolate, whipped cream, and cherry layers, is more than just a decadent dessert. It's a slice of history.",
        "ingredients": ["Flour", "Butter", "Cocoa", "Baking Powder", "Vanilla Essence", "Tinned Cherries", "Cream"],
        "cookingTime": "3 hour 30 mins",
        "instructions": ["1) Bake the cake: Prepare a chocolate sponge cake batter by mixing flour, cocoa powder, baking powder, eggs, sugar, and butter.", 
                            "Bake for 30-35 minutes. Let it cool completely.",
                         "2) Prepare the filling and frosting: Whip heavy cream with powdered sugar and vanilla extract until stiff peaks form.", 
                            "Pit and chop fresh cherries (or use canned cherries).",
                         "3) Slice the cake: Cut the cooled sponge cake horizontally into 2-3 even layers.",
                         "4) Assemble the cake: Place one layer on a serving plate, drizzle with cherry syrup or sugar syrup, spread whipped cream, and add chopped cherries.", 
                            "Repeat with remaining layers.",
                         "5) Frost and decorate: Cover the entire cake with whipped cream.", 
                            "Decorate with chocolate shavings, whole cherries, and a drizzle of cherry syrup if desired.",
                         "6) Chill and serve: Refrigerate for at least 1-2 hours before slicing and serving."]
    },
    {
        "id": 8,
        "title": "Ice Cream Sundees",
        "image": "Ice_cream.png",
        "category": "Dessert",
        "shortDescription": "Ice cream is a mixture of milk, cream, sugar, and sometimes other ingredients, frozen into a soft, creamy delight using special techniques.",
        "ingredients": ["Condensed Milk", "Vanilla Essence", "Fruits", "Choclate Chips", "Sugar", "Fresh Cream", "Choclate Syrup", "Cinnamon"],
        "cookingTime": "10 mins",
        "instructions": ["1) Scoop your favorite ice cream into a bowl or glass.",
                         "2) Drizzle with toppings like chocolate syrup, caramel, or fruit sauce.",
                         "3) Add layers of whipped cream, nuts, sprinkles, or fresh fruits.",
                         "4) Top with a cherry or candy for decoration.",
                         "5) Serve immediately and enjoy!"]
    },
    {
        "id": 9,
        "title": "Kadai Paneer",
        "image": "Kadai_paneer.png",
        "category": "Lunch",
        "shortDescription": "A tender, spicy Kadai Paneer is a popular South Indian dish made with paneer, spices, and a sweet sauce.",
        "ingredients": ["Paneer", "Onions", "Garlic", "Ginger", "Cumin", "Coriander", "Cinnamon", "Sugar", "Mustard", "Spices", "Oil"],
        "cookingTime": "35 mins",
        "instructions": ["1) Prepare the spice mix: Dry roast coriander seeds, cumin seeds, and dried red chilies. Grind them coarsely and set aside.",
                         "2) Cook the vegetables: Heat oil in a pan, sauté diced onions, capsicum, and tomatoes until they are soft but still slightly crunchy.", 
                            "Remove and keep aside.",
                         "3) Make the base masala: In the same pan, sauté finely chopped onions until golden brown.", 
                            "Add ginger-garlic paste and cook until fragrant.",
                         "4) Add spices and tomato puree: Stir in turmeric, red chili powder, and the roasted spice mix.", 
                            "Add tomato puree and cook until the oil separates.",
                         "5) Add paneer and vegetables: Toss in the sautéed vegetables and paneer cubes. Mix gently to coat everything in the masala.",
                         "6) Simmer and garnish: Simmer for 5-7 minutes. Garnish with fresh coriander leaves and a sprinkle of garam masala.",
                         "7) Serve: Serve hot with naan, roti, or jeera rice."]
    },
    {
        "id": 10,
        "title": "Kaju Katli",
        "image": "Kaju_katli.png",
        "category": "Dessert",
        "shortDescription": "Kaju Katli or Kaju Barfi is a traditional Indian cashew fudge candy that's terrifically smooth, thin, and melts in your mouth.",
        "ingredients": ["Cashew Nuts", "Milk Powder", "Ghee", "Sugar", "Water", "Rose Water", "Silver Leaf"],
        "cookingTime": "50 mins",
        "instructions": ["1) Grind cashews: Blend cashews into a fine powder, ensuring they don’t release oil.",
                         "2) Prepare sugar syrup: Heat sugar and water in a pan until the sugar dissolves completely.", 
                            "You need a one-string consistency syrup.",
                         "3) Cook the mixture: Add the cashew powder to the sugar syrup and cook on low heat, stirring continuously,",
                            "until the mixture thickens and leaves the sides of the pan.",
                         "4) Knead the dough: Transfer the mixture to a greased surface, let it cool slightly, and knead it into a smooth dough while it’s warm.",
                         "5) Roll and cut: Roll the dough into a thin sheet using a rolling pin and cut into diamond-shaped pieces.",
                         "6) Cool and serve: Let the pieces cool completely before serving or storing in an airtight container."]
    },
    {
      "id": 11,
        "title": "Motichoor Ladoo",
        "image": "Ladoo.png",
        "category": "Dessert",
        "shortDescription": "Popular Indian sweet, Motichoor Ladoo has tiny pearls of boondi (made from gram flour) fried in ghee and then mixed with sugar syrup!",
        "ingredients": ["Gram Flour", "Baking Soda", "Ghee", "Sugar", "Water", "Milk", "Cardamom Powder", "Saffron"],
        "cookingTime": "60 mins",
        "instructions": ["1) Prepare the boondi batter: Mix gram flour (besan) with water to form a smooth, flowing batter.",
                         "2) Fry the boondi: Heat ghee or oil, pour the batter through a perforated ladle to form small drops (boondi), and fry until golden but not crispy. Drain excess oil.",
                         "3) Make the sugar syrup: Boil sugar and water with a pinch of cardamom powder until you get a sticky consistency (1-string consistency).", 
                            "Add orange or yellow food color if desired.",
                         "4) Combine boondi and syrup: Mix the fried boondi with the sugar syrup and let it soak for 10-15 minutes.",
                         "5) Shape the ladoos: Add a few chopped nuts (optional) and mash the mixture lightly.", 
                            "Take small portions and shape them into round ladoos.",
                         "6) Cool and serve: Let the ladoos set completely before serving or storing in an airtight container."]  
    },
    {
       "id": 12,
        "title": "Jalebi",
        "image": "Jalebi.png",
        "category": "Dessert",
        "shortDescription": "Jalebi is a popular sweet snack in the Indian subcontinent, It is a spiral shaped crisp & juicy sweet dessert.",
        "ingredients": ["Flour", "Yogurt", "Cornflour", "Baking soda", "Sugar", "Cardamom Powder", "Turmeric", "Ghee"],
        "cookingTime": "30 mins",
        "instructions": ["1) Prepare the batter: Mix all-purpose flour (maida), yogurt, and a pinch of turmeric or food color.", 
                            "Add water gradually to form a smooth, flowing batter. Let it ferment for 8-10 hours or overnight.",
                         "2) Make the sugar syrup: Heat sugar and water until it reaches a sticky one-string consistency.", 
                            "Add cardamom powder, saffron, or rose water for flavor. Keep warm.",
                         "3) Pipe the jalebis: Fill a piping bag or a squeeze bottle with the batter. Heat oil or ghee in a pan.", 
                            "Pipe the batter into the hot oil in spiral shapes.",
                         "4) Fry until crisp: Fry the jalebis on medium heat until golden and crispy on both sides.",
                         "5) Soak in syrup: Immediately transfer the hot jalebis into the warm sugar syrup and let them soak for a minute.",
                         "6) Serve: Remove, serve hot, and enjoy crispy, syrupy jalebis!"]  
    },
    {
        "id": 13,
        "title": "Mojito",
        "image": "Mojito_drink.png",
        "category": "Beverages",
        "shortDescription": "Mojito is a traditional Cuban punch",
        "ingredients": ["White Rum", "Sugar", "Mint Leaves", "Water", "Lime Juice"],
        "cookingTime": "10 mins",
        "instructions": ["1) Muddle ingredients: In a glass, muddle 8-10 fresh mint leaves, 2-3 lime wedges, and 2 teaspoons of sugar to release the flavors.",
                         "2) Add ice: Fill the glass halfway with crushed ice.",
                         "3) Pour the liquid: Add 60 ml of white rum (optional for non-alcoholic mojito) and top with soda water or sparkling water.",
                         "4) Mix well: Stir gently to combine the flavors.",
                         "5) Garnish and serve: Garnish with a mint sprig and a lime slice. Serve chilled and enjoy!"]
    },
    {
        "id": 14,
        "title": "Aam Panna",
        "image": "Aam_panna.png",
        "category": "Beverages",
        "shortDescription": "Aam panna, Aam Jhora(), or panha is an Indian Summer drink. It is made from unripe mangoes.",
        "ingredients": ["Mango Pulp", "Sugar", "Mint Leaves", "Water", "Black Salt", "Cumin Powder"],
        "cookingTime": "25 mins",
        "instructions": ["1) Boil raw mangoes: Boil or pressure-cook 2-3 raw mangoes until soft. Let them cool and then peel the skin.",
                         "2) Extract the pulp: Scoop out the mango pulp and discard the seeds.",
                         "3) Blend the mixture: Blend the pulp with sugar, roasted cumin powder, black salt, and a pinch of black pepper.",  
                            "Add a few mint leaves for extra freshness.",
                         "4) Dilute with water: Mix the concentrate with chilled water to adjust the consistency.",
                         "5) Serve: Pour into glasses, add ice cubes, and garnish with mint leaves or a sprinkle of cumin powder. Serve chilled!"]
    },
    {
        "id": 15,
        "title": "Chai Tea",
        "image": "Chai_tea.png",
        "category": "Beverages",
        "shortDescription": "Chai tea is a popular Indian tea",
        "ingredients": ["Chai Beans", "Sugar", "Water", "Milk", "Garlic"],
        "cookingTime": "10 mins",
        "instructions": ["1) Boil water: In a saucepan, bring 1 cup of water to a boil.",
                         "2) Add tea leaves: Add 1-2 teaspoons of loose black tea leaves (or 1 tea bag) to the boiling water and simmer for 2-3 minutes.",
                         "3) Add milk: Pour in 1/2 cup of milk (adjust to taste) and bring it back to a boil.",
                         "4) Sweeten: Add sugar to taste and stir until dissolved.",
                         "5) Strain and serve: Strain the tea into a cup and serve hot. Enjoy with snacks if desired!"]
    },
    {
        "id": 16,
        "title": "Blue Lagoon Mocktail",
        "image": "Mocktail.png",
        "category": "Beverages",
        "shortDescription": "The perfect non-alcoholic mocktail for hot summer days",
        "ingredients": ["Lemonade", "Ice Cubes", "Lemon Lime Soda", "Water", "Blue curacao syrup"],
        "cookingTime": "5 mins",
        "instructions":["1) Mix the base: In a shaker, combine 1/2 cup lemon juice, 1/4 cup blue curacao syrup (non-alcoholic),", 
                           "and 1-2 teaspoons of sugar or honey.",
                        "2) Add ice: Fill a glass with ice cubes and pour the mixture over it.",
                        "3) Top with soda: Top off the drink with Lemon soda or sparkling water and stir gently.",
                        "4) Garnish and serve: Garnish with a slice of lemon and a cherry. Serve chilled"]
    },
    {
        "id": 17,
        "title": "Masala Watermelon Juice",
        "image": "Watermelon_juice.png",
        "category": "Beverages",
        "shortDescription": "Indian style watermelon juice has chaat masala which adds tang and spice to counter balance the sweetness of the watermelon.",
        "ingredients": ["Watermelon", "Chaat Masala", "Black Salt", "Water", "Watermelon Slice"],
        "cookingTime": "10 mins",
        "instructions": ["1) Blend the watermelon: Cut 2 cups of fresh watermelon into chunks and blend until smooth.",
                         "2) Add spices: Add a pinch of black salt, a sprinkle of chaat masala, a dash of black pepper, and a squeeze of lemon juice to the blended watermelon.",
                         "3) Mix well: Stir the mixture to combine the spices.",
                         "4) Serve: Pour the juice into a glass, add ice cubes if desired, and garnish with a mint sprig or watermelon slice. Serve chilled!"]
    },
    {
        "id": 18,
        "title": "Kadhai Mushroom Recipe ",
        "image": "Mushroom.png",
        "category": "Lunch",
        "shortDescription": "Kadai Mushroom is such a super easy and delicious dish of sautéed button mushrooms in a spiced, tangy tomato sauce",
        "ingredients": ["Mushroom", "Onions", "Capsicum", "Water", "Tomatoes", "Garlic", "Ginger", "Spices"],
        "cookingTime": "30 mins",
        "instructions": ["1) Prepare the masala: Dry roast coriander seeds, cumin seeds, and dried red chilies, then grind them into a coarse powder.",
                         "2) Sauté the vegetables: Heat oil in a kadhai or wok, add finely chopped onions, ginger, and garlic, and sauté until golden brown.", 
                            "Add chopped tomatoes and cook until soft.",
                         "3) Add the spices: Stir in ground spices like garam masala, turmeric, red chili powder, and the freshly ground spice mix.", 
                            "Cook until the oil separates from the masala.",
                         "4) Cook the mushrooms: Add sliced mushrooms to the pan, toss them in the masala, and cook until tender and water from the mushrooms evaporates.",
                         "5) Finish and serve: Garnish with fresh coriander leaves and serve hot with roti or rice."]
    },
    {
        "id": 19,
        "title": "Dal Fry Recipe ",
        "image": "Dal_fry.png",
        "category": "Lunch",
        "shortDescription": "Dal Fry is a delicious and popular Indian lentil recipe that is made with arhar dal ",
        "ingredients": ["Arhar Dal", "Onions", "Herbs", "Water", "Tomato", "Spices", "Lemon Juice", "Coriander Leaves"],
        "cookingTime": "35 mins",
        "instructions": ["1) Cook the dal: Rinse 1 cup of Arhar dal (or yellow lentils) and pressure cook with 3 cups of water, turmeric, and salt for 3-4 whistles, or until soft.",
                         "2) Prepare the tempering: In a separate pan, heat ghee or oil. Add cumin seeds, finely chopped onions, green chilies, and ginger-garlic paste.", 
                            "Sauté until onions are golden brown.",
                         "3) Add tomatoes and spices: Add chopped tomatoes, red chili powder, garam masala, and cook until the tomatoes soften.",
                         "4) Combine dal and tempering: Add the cooked dal to the tempering mixture, adjust the consistency with water, and let it simmer for 5-10 minutes.",
                         "5) Finish and serve: Garnish with fresh coriander leaves and a squeeze of lemon juice. Serve hot with roti, naan, or rice."] 
    },
    {
        "id": 20,
        "title": "Mix Veg ",
        "image": "Mix_veg.png",
        "category": "Lunch",
        "shortDescription": "A perfect bowl filled with nutrients, made with lots of veggies",
        "ingredients": ["Cauliflower", "Carrots", "Potato", "Peas", "Capsicum", "Spices", "Salt", "Coriander Leaves"],
        "cookingTime": "60 mins",
        "instructions": ["1) Prepare the vegetables: Chop a mix of vegetables like carrots, beans, peas, potatoes, and cauliflower into small, even pieces.",
                         "2) Sauté the base: Heat oil in a pan and add cumin seeds, finely chopped onions, ginger, garlic, and green chilies. Sauté until the onions turn golden.",
                         "3) Cook the masala: Add chopped tomatoes, turmeric, red chili powder, coriander powder, and garam masala.", 
                            "Cook until the tomatoes soften and the oil separates from the masala.",
                         "4) Add the vegetables: Add the chopped vegetables and mix well. Add salt and cook covered on medium heat, stirring occasionally.",
                         "5) Simmer and serve: Once the vegetables are tender and cooked through, garnish with fresh coriander leaves. Serve hot with roti, rice, or paratha."] 
    },
    {
        "id": 21,
        "title": "Idli",
        "image": "Idli.png",
        "category": "BreakFast",
        "shortDescription": "Is a type of savoury rice cake, originating from South India, popular as a breakfast food in Southern India.",
        "ingredients": ["Rice", "Urad Dal", "Water", "Curry Leaves", "Methi Seeds"],
        "cookingTime": "60 mins",
        "instructions": ["1) Prepare the batter: Soak 1 cup of rice and 1/4 cup of urad dal (split black lentils) separately in water for 4-6 hours.", 
                            "Grind them together into a smooth batter, adding water as needed. Add salt to taste.",
                         "2) Ferment the batter: Leave the batter in a warm place for 8-12 hours or overnight to ferment, until it becomes bubbly and slightly risen.",
                         "3) Prepare the idli steamer: Grease the idli molds with a little oil. Fill the steamer with water and bring it to a boil.",
                         "4) Steam the idlis: Pour the fermented batter into the idli molds, place the molds in the steamer, and steam for 10-12 minutes or", 
                            "until a toothpick inserted comes out clean.",
                         "5) Serve: Remove the idlis from the molds, serve hot with chutney and sambar."] 
    },
    {
        "id": 22,
        "title": "Sandwich",
        "image": "Sandwich.png",
        "category": "BreakFast",
        "shortDescription": "Soft white bread is topped with a vibrant herb chutney, masala spices and layers of cucumber, onion and tomato.",
        "ingredients": ["Bread", "Tomato", "Cucumber", "Lettuce", "Cheese", "Mayonnaise", "Salt", "Pepper", "Boiled Potatoes"],
        "cookingTime": "20 mins",
        "instructions": ["1) Prepare the filling: Spread butter or mayonnaise on slices of bread. Add your choice of filling (e.g., cheese, lettuce, tomatoes and cucumbers).",
                         "2) Season: Add salt, pepper, and any desired sauces or condiments (mustard, ketchup, etc.).",
                         "3) Assemble: Place another slice of bread on top and press gently.",
                         "4) Grill (optional): If desired, grill the sandwich on a skillet or in a sandwich press until golden and crispy on both sides.",
                         "5) Serve: Cut into halves or quarters and serve immediately"] 
    },
    {
        "id": 23,
        "title": "Vada Pav",
        "image": "Vada_pav.png",
        "category": "Snacks",
        "shortDescription": "Vada Pav is a popular Indian snack made from a mixture of rice, flour, water, and yeast.",
        "ingredients": ["Bread", "Boiled Potatoes", "Water", "Spices", "Salt", "Ghee", "Garlic", "Ginger", "Chickpea Flour", "Rice Flour"],
        "cookingTime": "40 mins",
        "instructions": ["1) Prepare the vada filling: Boil 2-3 potatoes, mash them, and set aside.",
                            "In a pan, heat oil, and sauté mustard seeds, cumin, curry leaves, green chilies, ginger, and garlic. Add turmeric, coriander powder, and garam masala.",
                            "Mix with the mashed potatoes, and cook for a few minutes. Shape the mixture into small round balls.",
                         "2) Make the batter: In a bowl, prepare a thick batter by mixing chickpea flour (besan), rice flour, a pinch of turmeric,", 
                            "and salt with water to a consistency that coats the vada well.",
                         "3) Fry the vadas: Heat oil in a pan. Dip each potato ball into the batter and fry them until golden and crispy. Remove and drain excess oil.",
                         "4) Assemble the vada pav: Slice pav (soft bread rolls) horizontally, spread green chutney and tamarind chutney on the inside, and place the vada inside.",
                         "5) Serve: Serve hot with chutneys and enjoy!"]
    },
    {
        "id": 24,
        "title": "Poha",
        "image": "Poha_recipe.png",
        "category": "BreakFast",
        "shortDescription": "Poha also known as Pohe is a quick Indian Breakfast, filled with nutrients",
        "ingredients": ["Flattened Rice", "Onions", "Spices", "Herbs", "Lemon Juice", "Peanuts", "Coriander Leaves", "Salt", "Mustard Seeds", "Turmeric", "Green Chilies", "Curry Leaves"],
        "cookingTime": "25 mins",
        "instructions": ["1) Prepare the poha: Rinse 1 1/2 cups of flattened rice (poha) in water and drain it well. Set aside for a few minutes to soften.",
                         "2) Sauté the ingredients: Heat oil in a pan, and add mustard seeds. Once they splutter, add cumin seeds, curry leaves, finely chopped onions, green chilies, and ginger.", 
                            "Sauté until the onions turn golden brown.",
                         "3) Cook the vegetables: Add chopped potatoes, peas, and other vegetables (optional), and cook until they are tender.",
                         "4) Add spices: Stir in turmeric powder, salt, and sugar. Add the soaked poha and mix gently to combine all ingredients.",
                         "5) Garnish and serve: Garnish with freshly chopped coriander leaves, a squeeze of lemon juice, and some roasted peanuts. Serve hot!"]
    },
    {
        "id": 25,
        "title": "Moong Dal Kachori",
        "image": "Kachori.png",
        "category": "BreakFast",
        "shortDescription": "The crispy little hand-pie-like circles have an amazing amount of flavor in them.",
        "ingredients": ["Flour", "Ghee", "Moong Dal", "Salt", "Turmeric", "Mango Powder", "Spices", "Ginger", "Fennel Seeds", "Green Chilies"],
        "cookingTime": "60 mins",
        "instructions": ["1) Prepare the filling: Soak 1/2 cup of yellow moong dal in water for 1-2 hours, then drain.", 
                            "In a pan, heat oil, and sauté cumin seeds, fennel seeds, ginger, and green chilies.", 
                            "Add the soaked moong dal, turmeric, red chili powder, garam masala, and salt.",
                            "Cook until the dal becomes soft but not mushy. Let the filling cool.",
                         "2) Make the dough: In a bowl, mix 1 cup of all-purpose flour (maida) with a pinch of salt and 1 tablespoon of oil.", 
                            "Gradually add water to knead into a smooth, soft dough. Let it rest for 15-20 minutes.",
                         "3) Assemble the kachoris: Divide the dough into small balls. Flatten each ball into a small disc.", 
                            "Place a spoonful of the moong dal filling in the center and fold the edges to seal it.", 
                            "Roll gently to form a ball again.",
                         "4) Fry the kachoris: Heat oil in a deep frying pan on medium heat. Fry the kachoris in batches until golden and crispy on all sides.",
                         "5) Serve: Drain excess oil on a paper towel and serve hot with tamarind chutney or mint chutney."]
    },
    {
        "id": 26,
        "title": "Aloo Paratha",
        "image": "Aloo_paratha.png",
        "category": "BreakFast",
        "shortDescription": " Aloo Paratha are Indian Breakfast flatbreads.",
        "ingredients": ["Wheat Flour", "Ghee", "Boiled Potatoes", "Salt", "Coriander Leaves", "Spices", "Water"],
        "cookingTime": "30 mins",
        "instructions": ["1) Prepare the filling: Boil 2-3 medium-sized potatoes, peel and mash them. In a pan, heat oil, and sauté cumin seeds, chopped green chilies, grated ginger, and onions (optional).", 
                            "Add the mashed potatoes, salt, red chili powder, turmeric, garam masala, and chopped coriander leaves. Mix well and cook for a few minutes. Let it cool.",
                         "2) Make the dough: In a mixing bowl, combine 2 cups of whole wheat flour, salt, and water. Knead into a soft, smooth dough and let it rest for 15-20 minutes.",
                         "3) Assemble the paratha: Divide the dough into small balls. Flatten each ball into a small disc using your fingers or a rolling pin.", 
                            "Place a generous amount of the potato filling in the center, fold the edges, and seal the dough around the filling. Roll it gently into a flat disc.",
                         "4) Cook the paratha: Heat a tawa or griddle on medium heat. Place the rolled paratha on it and cook for 1-2 minutes on each side, pressing gently with a spatula.", 
                            "Flip and apply ghee or oil on both sides until golden brown and crispy.",
                         "5) Serve: Serve hot with yogurt, pickle, or butter. Enjoy!"]
    },
    {
        "id": 27,
        "title": "Samosas",
        "image": "Samosas.png",
        "category": "Snacks",
        "shortDescription": "Samosas are a popular Indian snack made from a mixture of rice, flour, water, and yeast.",
        "ingredients": ["Wheat Flour", "Boiled Potatoes", "Water", "Salt", "Peanuts", "Spices"],
        "cookingTime": "35 mins",
        "instructions": ["1) Prepare the filling: Boil 2-3 medium-sized potatoes and mash them. In a pan, heat oil and sauté cumin seeds, finely chopped onions, ginger, garlic, and green chilies.", 
                            "Add chopped vegetables like peas, carrots, or beans if desired. Then, add turmeric, red chili powder, garam masala, and salt.", 
                            "Cook until the mixture is dry and well-combined. Let it cool.",
                         "2) Make the dough: In a bowl, mix 2 cups of all-purpose flour (maida), 1/4 teaspoon salt, and 2 tablespoons of oil.", 
                            "Gradually add water and knead into a smooth dough. Rest the dough for 20 minutes.",
                         "3) Shape the samosas: Divide the dough into small balls. Roll each ball into a thin oval or circle. Cut it in half to form two semi-circles.", 
                            "Create a cone shape by folding each semi-circle, sealing the edges with a little water.", 
                            "Stuff the cone with the prepared filling and seal the open edge by pinching it together.",
                         "4) Fry the samosas: Heat oil in a deep frying pan on medium heat. Fry the samosas in batches until golden brown and crispy on all sides.", 
                            "Remove and drain excess oil on a paper towel.",
                         "5) Serve: Serve hot with mint chutney or tamarind chutney. Enjoy!"]
    },
    {
        "id": 28,
        "title": "Momo",
        "image": "Momo.png",
        "category": "Snacks",
        "shortDescription": "Momos are a type of steamed filled dumpling, popular in India ,Nepal and Tibet",
        "ingredients": ["Flour", "Carrots", "Cabbage", "Salt", "Pepper", "Onions", "Ginger", "Garlic", "Soya sauce"],
        "cookingTime": "50 mins",
        "instructions": ["1) Prepare the filling: Mix finely chopped vegetables (cabbage, carrots, onions) with ginger, garlic, soy sauce, and seasoning.",
                         "2) Make the dough: Combine flour, salt, and water to form a smooth dough. Let it rest for 20 minutes.",
                         "3) Shape the momos: Roll dough into discs, add the veggie filling, and seal by pleating the edges.",
                         "4) Steam the momos: Steam for 10-15 minutes until cooked.",
                         "5) Serve: Serve hot with dipping sauce. Enjoy"]
    },
    {
        "id": 29,
        "title": "Indian Style Chowmin",
        "image": "Chowmin.png",
        "category": "Snacks",
        "shortDescription": " Chowmein is a popular Asian dish where stir fried noodles are tossed with lots of vegetables and sauces",
        "ingredients": ["Chowmin", "Pepper", "Spring Onions", "Carrots", "Cabbage", "Salt", "Bell Peppers", "Capsicum", "Soya sauce", "Vinegar", "Garlic", "Ginger"],
        "cookingTime": "20 mins",
        "instructions": ["1) Cook the noodles: Boil noodles as per the package instructions, drain, and set aside.",
                         "2) Prepare the vegetables: Slice vegetables like carrots, cabbage, bell peppers, and onions.",
                         "3) Stir-fry the veggies: Heat oil in a pan, add ginger, garlic, and vegetables. Stir-fry on high heat for 2-3 minutes.",
                         "4) Add sauces and noodles: Add soy sauce, vinegar, chili sauce, and salt. Toss in the cooked noodles and mix well.",
                         "5) Serve: Garnish with spring onions and serve hot. Enjoy!"]
    },
    {
        "id": 30,
        "title": "Paani Puri",
        "image": "Paani_puri.png",
        "category": "Snacks",
        "shortDescription": "Pani puri is an immensely popular Indian street food",
        "ingredients": ["Coriander Leaves", "Boiled Potatoes", "Spices", "Salt", "Semolina (Sooji)", "Tamarind Pulp", "Black Salt", "Chickpeas", "Lemon Juice"],
        "cookingTime": "40 mins",
        "instructions": ["1) Prepare the puris: You can either buy ready-made puris or prepare them by deep frying dough balls made from semolina (sooji) and flour,", 
                            "shaping them into small rounds, and crisping them in hot oil.",
                         "2) Prepare the filling: Boil 2-3 medium potatoes and mash them. Mix with 1/2 cup boiled chickpeas, chopped onions, coriander leaves,", 
                            "salt, red chili powder, and chaat masala. Set aside.",
                         "3) Prepare the pani: Blend a handful of fresh mint leaves, coriander leaves, green chilies, tamarind pulp, lemon juice, cumin powder, black salt, and regular salt with chilled water.", 
                            "Strain to remove any solids, adjust seasoning, and refrigerate to chill further.",
                         "4) Assemble the pani puri: Gently crack each puri in the center, stuff it with the prepared potato and chickpea mixture, and dip it into the chilled pani.",
                         "5) Serve: Serve immediately while the puris are still crisp, and enjoy the refreshing and tangy flavors!"]
    },
    {
        "id": 31,
        "title": "Veg Biryani",
        "image": "Veg_biryani.png",
        "category": "Dinner",
        "shortDescription": "Veg Biryani is a simple and delicious Indian stir-fried vegetable dish.",
        "ingredients": ["Rice", "Vegetables", "Onions", "Mint Leaves", "Garlic", "Ginger", "Cumin", "Coriander", "Water", "Salt", "Saffron"],
        "cookingTime": "45 mins",
        "instructions": ["1) Prepare the rice: Rinse 1 1/2 cups basmati rice and soak for 30 minutes.", 
                            "In a large pot, bring water to a boil, add whole spices (like cinnamon, cloves, cardamom), and cook the rice until 70-80% done.", 
                         "2) Drain and set aside.",
                         "3) Prepare the vegetables: Chop vegetables like carrots, beans, peas, potatoes, and cauliflower. In a pan, heat oil, and sauté the vegetables until slightly tender.", 
                            "Add ginger-garlic paste and cook for 2 minutes.",
                         "4) Make the masala: Add chopped onions and cook until golden. Then, add chopped tomatoes, turmeric, red chili powder, garam masala, and salt.", 
                            "Cook until the tomatoes soften and the oil separates.",
                         "5) Layer the biryani: In a large pot, layer the partially cooked rice over the vegetable masala.", 
                            "Sprinkle saffron milk or yellow food coloring (optional), mint leaves, and fried onions on top.", 
                            "Cover tightly with a lid and cook on low heat for 20-25 minutes to allow the flavors to blend.",
                         "6) Serve: Garnish with fresh coriander and serve hot with raita or salad. Enjoy!"]
    },
    {
        "id": 32,
        "title": "Chicken Tikka Masala",
        "image": "Chicken_tikka.png",
        "category": "Dinner",
        "shortDescription": "Chicken Tikka Masala is a popular Indian chicken dish.",
        "ingredients": ["Chicken", "Onions", "Garlic", "Ginger", "Cumin", "Coriander", "Tomato", "Water", "Salt", "Cream"],
        "cookingTime": "40 mins",
        "instructions": ["1) Marinate the chicken: Cut 500g chicken into cubes. In a bowl, mix yogurt, lemon juice, ginger-garlic paste, red chili powder, turmeric, garam masala, and salt.", 
                            "Add the chicken pieces, coat well, and marinate for 1-2 hours.",
                         "2) Cook the chicken: Preheat a grill or oven. Skewer the marinated chicken and grill or bake at 200°C for 15-20 minutes until cooked through and slightly charred.", 
                            "Alternatively, pan-fry the chicken pieces in a little oil.",
                         "3) Make the masala sauce: In a pan, heat oil and sauté finely chopped onions, ginger, and garlic until golden.", 
                            "Add chopped tomatoes, red chili powder, cumin powder, coriander powder, and garam masala. Cook until the tomatoes break down and the oil separates.",
                         "4) Combine chicken and sauce: Add the grilled chicken pieces to the masala sauce, along with a little water to adjust the consistency. Simmer for 10 minutes.",
                         "5) Finish and serve: Add cream to make the sauce rich and creamy. Garnish with fresh coriander leaves and serve hot with naan or rice. Enjoy!"]
    },
    {
        "id": 33,
        "title": "Paneer Afghani",
        "image": "Paneer_Afghani.png",
        "category": "Dinner",
        "shortDescription": "Paneer Afghani is a delightful fusion dish that combines the richness of paneer with a blend of aromatic spices",
        "ingredients": ["Yogurt", "Cashew Paste", "Paneer", "Coriander Leaves", "Onions", "Garlic", "Ginger", "Cumin", "Water", "Salt", "Cream", "Green Chilies", "Cardamom Powder"],
        "cookingTime": "3 hours",
        "instructions": ["1) Prepare the marinade: In a bowl, mix yogurt, cream, ginger-garlic paste, lemon juice, green chili paste, garam masala, red chili powder, cardamom powder, and salt.", 
                            "Add 250g paneer cubes and coat them well with the marinade. Let it sit for 1-2 hours.",
                         "2) Cook the paneer: Preheat a grill or oven to 180°C. Skewer the marinated paneer cubes and grill or bake for 15-20 minutes until lightly charred and cooked.", 
                            "Alternatively, you can shallow fry them in a pan with a little oil.",
                         "3) Prepare the Afghani sauce: In a pan, heat butter and sauté finely chopped onions, garlic, and green chilies. Add a little water and cook until soft.", 
                            "Add cashew paste, cardamom powder, and a pinch of garam masala. Cook the mixture until it thickens.",
                         "4) Combine and simmer: Add the grilled paneer cubes to the prepared sauce, mix gently, and cook for 5-10 minutes. Add fresh cream for richness.",
                         "5) Serve: Garnish with fresh coriander and serve hot with naan or rice. Enjoy!"]
    },
    {
        "id": 34,
        "title": "Veg Manchurian",
        "image": "Manchurian.png",
        "category": "Dinner",
        "shortDescription": "Is simply a crispy fried mixed vegetable balls in a sweet, spicy, tangy, manchurian gravy or sauce.",
        "ingredients": ["Vegetables", "Cornflour", "Spices", "Garlic", "Ginger", "Cumin", "Coriander", "Water", "Salt", "Gram Flour", "Sauce", "Flour", "Onions", "Sugar"],
        "cookingTime": "1 hour 20 mins",
        "instructions": ["1) Prepare the Manchurian balls: Grate or finely chop vegetables like cabbage, carrots, and beans.", 
                         "2) Squeeze out excess water, then mix them with corn flour, all-purpose flour, ginger-garlic paste, salt, and pepper.", 
                         "3) Shape the mixture into small balls and deep fry them until golden and crispy. Set aside.",
                         "4) Make the Manchurian sauce: In a pan, heat oil and sauté finely chopped garlic, ginger, and green chilies. Add chopped onions, bell peppers, and cook for a few minutes.", 
                            "Add soy sauce, vinegar, ketchup, chili sauce, and a pinch of sugar. Cook for a few more minutes until the sauce thickens.",
                         "5) Combine the Manchurian balls and sauce: Add the fried Manchurian balls to the sauce, mix gently, and cook for 5-7 minutes so the balls absorb the flavors.",
                         "6) Garnish and serve: Garnish with spring onions and serve hot with fried rice or noodles. Enjoy!"]
    },
    {
        "id": 35,
        "title": "Butter Naan",
        "image": "Naan.png",
        "category": "Dinner",
        "shortDescription": "Butter naan is traditional tandoori-style Indian naan bread brushed with melted butter at the end.",
        "ingredients": ["Ghee", "Yogurt", "Coriander", "Water", "Sugar", "Wheat Flour", "Salt", "Baking Powder"],
        "cookingTime": "3 hours",
        "instructions": ["1) Prepare the dough: In a bowl, mix 2 cups of all-purpose flour, 1 teaspoon sugar, 1/2 teaspoon salt, 1/2 teaspoon baking powder, and 2 tablespoons yogurt.", 
                            "Add water gradually and knead into a smooth dough. Cover and let it rest for 1-2 hours.",
                         "2) Roll the dough: Divide the dough into small balls and roll each ball into a flat, oval or round shape using a rolling pin.",  
                            "Dust with flour to prevent sticking.",
                         "3) Cook the naan: Heat a tawa or griddle on medium-high heat. Place the rolled naan on the hot surface and cook until bubbles form on the top.", 
                            "Flip and cook for another 1-2 minutes.",
                         "4) Add butter: Brush the cooked naan with melted butter and remove from the tawa.",
                         "5) Serve: Serve the soft and buttery naan hot with curries or dips. Enjoy!"]
    },
    {
        "id": 36,
        "title": "Rajma Chawal",
        "image": "Rajma_chawal.png",
        "category": "Dinner",
        "shortDescription": "Rajma Chawal is a popular Indian rice dish with a rich, flavorful sauce.",
        "ingredients": ["Rice", "Vegetables", "Onions", "Garlic", "Ginger", "Cumin", "Coriander", "Water", "Salt", "Rajma"], 
        "cookingTime":"40 mins",
        "instructions": ["1) Soak the rajma: Soak 1 cup of rajma (kidney beans) in water for 6-8 hours or overnight.", 
                            "Drain the water before cooking.",
                         "2) Cook the rajma: In a pressure cooker, add the soaked rajma with fresh water and cook for 4-5 whistles or until tender. Set aside.",
                         "3) Prepare the masala: In a pan, heat oil and sauté chopped onions, ginger-garlic paste, and green chilies until golden.", 
                            "Add chopped tomatoes, red chili powder, turmeric, cumin powder, coriander powder, garam masala, and salt.", 
                            "Cook until the tomatoes soften and the oil separates.",
                         "4) Combine the rajma and masala: Add the cooked rajma along with some water to adjust the consistency.", 
                            "Simmer for 15-20 minutes, allowing the flavors to blend.",
                         "5) Serve: Garnish with fresh coriander leaves and serve hot with steamed rice (chawal). Enjoy!"] 
    }    
]



